``matrix_mul``

	>>> module = __import__('100-matrix_mul')
	>>> matrix_mul = module.matrix_mul

		<<======================>>

	>>> matrix_mul([[1, 2], [3, 4]], [[1, 2], [3, 4]])
	[[7, 10], [15, 22]]

		<======================>>

	>>> matrix_mul([[1, 2, 3], [4, 5, 6]], [[7, 8], [9, 10], [11, 12]])
	[[58, 64], [139, 154]]

		<<======================>>


	>>> matrix_mul([[1, 2], [3, 4], [5, 6]], [[7, 8, 9], [10, 11, 12]])
	[[27, 30, 33], [61, 68, 75], [95, 106, 117]]

		<<======================>>

	>>> matrix_mul([[1, 2, 3]], [[4], [5], [6]])
	[[32]]

		<<======================>>

	>>> matrix_mul([[1, 2], [3, 4], [5, 6]], [[7, 8], [9, 10]])
	[[25, 28], [57, 64], [89, 100]]

		<<======================>>

	>>> matrix_mul([[1, 2], [3, 4]], [[1, 2, 3], [4, 5, 6]])
	[[9, 12, 15], [19, 26, 33]]

		<<======================>>

	>>> matrix_mul([[1, 2], [3, 4]], [])
	Traceback (most recent call last):
	...
	TypeError: m_b must be a list of lists

		<<======================>>

	>>> matrix_mul([], [[1, 2], [3, 4]])
	Traceback (most recent call last):
	...
	TypeError: m_a must be a list of lists

		<<======================>>

	>>> matrix_mul([[1, 3, 4], [0, 3, 5]], [[1, 2]])
	Traceback (most recent call last):
	...
	ValueError: m_a and m_b can't be multiplied
